app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
    <%= f.label :category_id %>
    <%= f.collection_select :category_id, Category.order(:name),
    :id, :name, {include_blank: true}, class: 'form-control' %>