app/controllers/categories_controller.rb

  def show
    @posts = Post.where(category_id: [@category.subtree_ids])
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" IN (2, 3, 4)

  def new
    @category = Category.new
    @categories = Category.all.order(:name)
---
SELECT "categories".* FROM "categories" WHERE (id != ) ORDER BY "categories"."name" ASC

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at", "ancestry") VALUES (?, ?, ?, ?)  [["name", "HTML"], ["created_at", "2019-12-25 23:35:24.665790"], ["updated_at", "2019-12-25 23:35:24.665790"], ["ancestry", "4"]]

  def edit
    @categories = Category.where("id != #{@category.id}").order(:name)
---
SELECT "categories".* FROM "categories" WHERE (id != 2) ORDER BY "categories"."name" ASC

  def update
    if @category.update_attributes(category_params)
---
UPDATE "categories" SET "name" = ?, "ancestry" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Ruby"], ["ancestry", "4"], ["updated_at", "2019-12-25 22:27:36.849602"], ["id", 2]]