app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "123"], ["summary", "3333"], ["body", "11111111111111"], ["created_at", "2019-12-25 16:25:23.053504"], ["updated_at", "2019-12-25 16:25:23.053504"], ["category_id", 3]]
---
  def create
    @post = Post.new(post_params)
    if @post.save

UPDATE "posts" SET "title" = ?, "summary" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "0"], ["summary", "0"], ["body", "0"], ["updated_at", "2019-12-24 21:59:31.414944"], ["id", 3]]
---
  def update
    if @post.update(post_params)